// 引入lodash
const _ = require('../assets/lodash.js') // 这里的require的意思是引入，引入的是lodash.js文件，这里的路径是相对路径，相对于当前文件的路径，也就是lodash-test.

// ------------------- Array -------------------
// -----------------------------------------------------------------------------------------
// _.chunk
let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let arr2 = _.chunk(arr, 3)
console.log(arr2)

// _.chunk(array, [size=1])，这里chunk是分块的意思，也就是把一个数组分成几个数组，
// 每个数组里面有size个元素，如果不能整除，最后剩余的元素也会单独作为一个数组。

// -----------------------------------------------------------------------------------------
// _.compact
// let arr = [0, 1, false, 2, '', 3, null, 4, undefined, 5, NaN, 6]
// let arr2 = _.compact(arr)
// console.log(arr2)

// _.compact(array)，这里compact是压缩的意思，也就是把数组里面的假值去掉，返回一个新的数组。
// 假值有：false, null, 0, "", undefined, NaN

// -----------------------------------------------------------------------------------------
// _.concat
// let arr = [1]
// let arr2 = _.concat(arr, 2, [3], [[4]])

