/*
 * @Author: tanhong
 * @Date: 2021-08-23 09:39:29
 * @LastEditTime: 2021-08-23 14:42:51
 * @LastEditors: tanhong
 * @FilePath: \blog\project\JavaScript\作用域链.js
 */
// 实参(argument)：
// 全称为"实际参数"是在调用时传递给函数的参数. 实参可以是常量、变量、表达式、函数等，
// 无论实参是何种类型的量，在进行函数调用时，它们都必须具有确定的值， 以便把这些值传送给形参。
// 因此应预先用赋值，输入等办法使实参获得确定值。

// 形参(parameter)：
// 全称为"形式参数" 由于它不是实际存在变量，所以又称虚拟变量。
// 是在定义函数名和函数体的时候使用的参数,目的是用来接收调用该函数时传入的参数.
// 在调用函数时，实参将赋值给形参。因而，必须注意实参的个数，类型应与形参一一对应，并且实参必须要有确定的值。

// 1.形参和变量声明
// 2.实参值赋给形参
// 3.寻找函数声明
// 4.执行函数
